# Taller 3

In [16]:
import pandas as pd

In [24]:
df = pd.DataFrame(
    {
        "Votos": [5, 8, 4 ,9 ,2, 3, 4, 9, 5],
        "Candidato": ["Federico Gutierrez", "Gustavo Petro", "Rodolfo Hernández", "Federico Gutierrez", "Gustavo Petro", "Rodolfo Hernández", "Federico Gutierrez", "Gustavo Petro", "Rodolfo Hernández"],
        "Departamento": ["Cundinamarca", "Cundinamarca", "Cundinamarca", "Meta", "Meta", "Meta", "Guaviare", "Guaviare", "Guaviare"],        
    }
)
df

   Votos           Candidato  Departamento
0      5  Federico Gutierrez  Cundinamarca
1      8       Gustavo Petro  Cundinamarca
2      4   Rodolfo Hernández  Cundinamarca
3      9  Federico Gutierrez          Meta
4      2       Gustavo Petro          Meta
5      3   Rodolfo Hernández          Meta
6      4  Federico Gutierrez      Guaviare
7      9       Gustavo Petro      Guaviare
8      5   Rodolfo Hernández      Guaviare

In [4]:
df = pd.DataFrame({
    "Fiebre": ["Moderada", "Leve", "Alta", "Moderada", "Leve", "Alta"],
    "Casos": [4, 1, 2, 2, 4, 5],
    "Diagnóstico": ["Positivo", "Positivo", "Positivo", "Negativo", "Negativo", "Negativo"]
})
df

     Fiebre  Casos Diagnóstico
0  Moderada      4    Positivo
1      Leve      1    Positivo
2      Alta      2    Positivo
3  Moderada      2    Negativo
4      Leve      4    Negativo
5      Alta      5    Negativo

In [7]:
df.columns

Index(['Fiebre', 'Casos', 'Diagnóstico'], dtype='object')

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Fiebre       6 non-null      object
 1   Casos        6 non-null      int64
 2   Diagnóstico  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [3]:
df = pd.read_csv('https://raw.githubusercontent.com/plotly/datasets/master/gapminderDataFiveYear.csv')
df

          country  year         pop continent  lifeExp   gdpPercap
0     Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1     Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2     Afghanistan  1962  10267083.0      Asia   31.997  853.100710
3     Afghanistan  1967  11537966.0      Asia   34.020  836.197138
4     Afghanistan  1972  13079460.0      Asia   36.088  739.981106
...           ...   ...         ...       ...      ...         ...
1699     Zimbabwe  1987   9216418.0    Africa   62.351  706.157306
1700     Zimbabwe  1992  10704340.0    Africa   60.377  693.420786
1701     Zimbabwe  1997  11404948.0    Africa   46.809  792.449960
1702     Zimbabwe  2002  11926563.0    Africa   39.989  672.038623
1703     Zimbabwe  2007  12311143.0    Africa   43.487  469.709298

[1704 rows x 6 columns]

In [6]:
10000/(12*60)

13.88888888888889